---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ConstrainedToWall
source: html/afbbd73f-48cd-8da3-fab2-ccf6b28362ce.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ConstrainedToWall Property

Sketch Lines created with Pick Wall must remain parallel to the Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId ConstrainedToWall { get; }
```